{
  "easy": {
    "time": 60,
    "para": [
      "The sun shines brightly in the clear blue sky and children play happily in the park. Birds sing sweet songs on the trees while soft winds blow through the leaves. A dog runs across the grass chasing a ball, and a cat stretches lazily under the bench. I like to read a storybook while sitting near the fountain. Life feels peaceful and simple on such a warm and beautiful day.",
      "On Sunday morning, I wake up early to see the sunrise. The golden light slowly spreads across the sky and fills the room with brightness. My mother prepares breakfast, and the smell of bread and milk makes me smile. After eating, I ride my bicycle around the street, waving to neighbors and friends. The day is calm, and I enjoy every moment with my family.",
      "A small boy walks to school with a big smile on his face. His bag is filled with pencils, notebooks, and crayons. On the way, he stops to help an old man cross the road. At school, he sits in the first row and listens carefully to his teacher. During lunch, he shares food with his best friend. The day is simple but filled with kindness and joy.",
      "The beach is quiet in the morning. The waves touch the shore softly and leave small shells behind. Children build sandcastles while parents watch and laugh. I like to walk barefoot on the sand, feeling the cool water on my feet. Sometimes, I collect colorful stones and keep them as little treasures. The ocean always makes me feel calm and happy.",
      "I love to visit the library because it is full of wonderful books. The place is quiet, and people read with full attention. I choose a storybook with bright pictures and sit near the window. As I turn the pages, I feel excited to know what happens next. Time passes quickly when I read. Books are like friends that teach me something new every day."
    ]
  },
  "medium": {
    "time": 180,
    "para": [
      "Farmers work hard in the fields, growing crops that feed many families. In the early morning, they plough the land and water the plants. During the hot afternoon, they take short breaks under the shade of big trees. Their hands become rough, but their hearts remain strong. The work is not easy, yet it brings happiness when they see golden grains ready for harvest. Without farmers, we cannot imagine life, because they provide us with the food we eat daily.",
      "The teacher stands in the classroom, explaining an interesting lesson to the students. Some write notes quickly, while others listen carefully. When the bell rings, the sound of laughter fills the corridors as students rush to the playground. They play football, cricket, and hide-and-seek until they are tired. After returning, they sit quietly, finishing homework and preparing for the next subject. A school day is a mix of learning, playing, and growing together with friends.",
      "Music is a language that touches the heart without words. When we listen to soft tunes after a busy day, it helps us feel relaxed. Some people enjoy classical music, while others love fast beats. A guitarist may express feelings through strings, while a singer shares emotions through lyrics. Music is everywhere: in celebrations, prayers, and even in nature. It teaches us to connect, to feel, and to express our thoughts in a special way.",
      "Airplanes fly high above the clouds, carrying passengers to different countries. People look out of the windows to see white clouds like cotton. Flight attendants walk down the aisle, offering food and drinks. Some passengers read books, while others listen to music or sleep. When the plane lands, families greet each other with smiles and hugs. Traveling by air connects the world and makes distances shorter than ever before.",
      "Children love playing in the park, where the swings and slides bring endless fun. They run with joy, climb trees, and race with friends. Parents sit on benches, watching and talking while keeping an eye on them. Sometimes, the sound of an ice cream cart makes them rush to buy a treat. Playtime is more than just fun; it teaches teamwork, sharing, and caring. Childhood memories from parks stay forever in the heart."
    ]
  },
  "hard": {
    "time": 180,
    "para": [
      "Typing quickly and accurately requires patience, focus, and regular practice. Numbers like 12345 or 67890 may seem easy, but combining them with symbols such as #, @, %, &, and * makes the task more challenging. A skilled typist must handle uppercase letters, lowercase letters, and punctuation marks together. For example: 'JavaScript's syntax includes {}, [], (), and ; which are essential for coding.' Accuracy above 95% is considered excellent, while speed above 75 WPM shows true mastery.",
      "Modern technology has changed the way we live, work, and communicate. Emails, video calls, and instant messages allow us to stay connected across the globe. But along with convenience comes distraction—notifications, updates, and advertisements. To stay productive, one must manage time wisely: avoid scrolling endlessly, take breaks, and focus on priorities. As the saying goes: 'Don't let technology control you; instead, control how you use it.' This balance is the real challenge of our digital age.",
      "Cybersecurity is a field that demands attention to detail. Hackers often try to break systems by exploiting weak passwords like '123456' or 'password@2025'. Strong passwords should include uppercase, lowercase, numbers, and symbols—for example: 'Xy!9@tQ5#'. Two-factor authentication adds another layer of protection, making it harder for attackers. Remember, safety online is not just about software; it's also about awareness, responsibility, and caution in every click.",
      "In competitive programming, speed and accuracy decide the winner. A small mistake such as a missing semicolon (;) or a misplaced bracket {} can cause an entire program to fail. Problem statements often include tricky test cases, requiring logical thinking and debugging skills. For instance, consider handling input like 'a,b,c; 1,2,3; #end'. One must parse carefully, write efficient algorithms, and test edge cases. Success depends on patience, focus, and consistent practice.",
      "Writing research papers requires proper formatting and citations. Tools like LaTeX allow authors to include mathematical equations, references, and structured sections. For example: 'E = mc^2' is typed as $E=mc^2$. Adding figures, tables, and footnotes improves readability. Academic honesty is key; plagiarism or copying without credit damages reputation. To maintain quality, every statement must be supported with reliable sources. Accuracy, structure, and clarity make research papers valuable."
    ]
  }
}
